In [1]:
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import numpy as np

In [2]:
drinks = pd.read_csv("http://bit.ly/drinksbycountry")
movies = pd.read_csv("http://bit.ly/imdbratings")
orders = pd.read_csv("http://bit.ly/chiporders", sep='\t')
orders['item_price'] = orders["item_price"].str.replace('$', '').astype('float')
stocks = pd.read_csv("http://bit.ly/smallstocks", parse_dates=['Date'])
titanic = pd.read_csv("http://bit.ly/kaggletrain")
ufo = pd.read_csv("http://bit.ly/uforeports", parse_dates=["Time"])

## 1. Show Installed Version

In [3]:
pd.__version__

'1.0.1'

In [4]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.7.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
machine          : AMD64
processor        : Intel64 Family 6 Model 158 Stepping 9, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.None

pandas           : 1.0.1
numpy            : 1.18.1
pytz             : 2019.3
dateutil         : 2.8.1
pip              : 20.0.2
setuptools       : 45.2.0.post20200210
Cython           : 0.29.14
pytest           : 5.3.5
hypothesis       : 5.5.4
sphinx           : 2.4.0
blosc            : None
feather          : None
xlsxwriter       : 1.2.7
lxml.etree       : 4.5.0
html5lib         : 1.0.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.1
IPython          : 7.12.0
pandas_datareader: None
bs4              : 4.8.2
bottleneck       : 1.3.2
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.5.0
matplotlib       : 3.1.3
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.3
pandas_gbq       : None
pyarrow          : None
pytables         : None
pytest           : 5.3.5
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.3.13
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
xlsxwriter       : 1.2.7
numba            : 0.48.0

## 2. Create Example DataFrame

In [5]:
df = pd.DataFrame({
    'col_one':[100, 200],
    'col_two':[300, 400]
})
df

   col_one  col_two
0      100      300
1      200      400

In [6]:
pd.DataFrame(np.random.rand(4, 8))

,0,1,2,3,4,5,6,7
0,0.188744,0.295232,0.528737,0.698802,0.750484,0.747052,0.838643,0.552421
1,0.124423,0.900685,0.989270,0.694172,0.927599,0.962279,0.167783,0.723356
2,0.569704,0.333691,0.228821,0.286771,0.084417,0.238637,0.418634,0.632326
3,0.352090,0.983836,0.758763,0.016290,0.135131,0.440376,0.727481,0.188002

In [7]:
pd.DataFrame(np.random.rand(4,8), columns=list('abcdefgh'))

,a,b,c,d,e,f,g,h
0,0.500363,0.093656,0.881860,0.339571,0.234076,0.330255,0.537731,0.811414
1,0.875387,0.018128,0.111122,0.289435,0.868690,0.648589,0.484970,0.920279
2,0.601189,0.176364,0.203471,0.113370,0.258948,0.041857,0.156059,0.404131
3,0.218725,0.282097,0.898441,0.886591,0.172730,0.392319,0.652909,0.805281

## 3. Rename Columns

In [8]:
df

   col_one  col_two
0      100      300
1      200      400

In [9]:
df = df.rename({
    'col_one':'kolom1',
    'col_two' : 'kolom2'
}, axis='columns')
df

   kolom1  kolom2
0     100     300
1     200     400

In [10]:
df.columns = ['col one', 'col two']
df

   col one  col two
0      100      300
1      200      400

In [11]:
df.columns = df.columns.str.replace(' ', '_')
df

   col_one  col_two
0      100      300
1      200      400

In [12]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [13]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

## 4. Reverse Row Order

In [14]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [15]:
drinks.loc[::-1].head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America

In [16]:
drinks.loc[::-1].reset_index(drop=True).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America

## 5. reverse Column Order

In [18]:
drinks.loc[:, ::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

## 6. Select columns by data type

In [19]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [20]:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [21]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [22]:
drinks.select_dtypes(include=['number', 'object', 'category', 'datetime']).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [23]:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

## 7. Convert Strings to numbers

In [24]:
df = pd.DataFrame({
    'col_one' : ['1.1', '2.2', '3.3'],
    'col_two' : ['4.4', '5.5', '6.6'],
    'col_three' : ['7.7', '8.8', '-']
})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [25]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [26]:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [27]:
pd.to_numeric(df["col_three"], errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [28]:
pd.to_numeric(df["col_three"], errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [30]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [31]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

## 8. Reduce DataFrame Size

In [32]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [33]:
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv("http://bit.ly/drinksbycountry", usecols=cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

In [35]:
dtype = {'continent':'category'}
smaller_drinks = pd.read_csv("http://bit.ly/drinksbycountry", usecols=cols, dtype=dtype)
smaller_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

## 9. Build a DataFrame from multiple files(row-wise)

In [36]:
pd.read_csv("datasets/stocks1.csv")

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT

In [37]:
pd.read_csv("datasets/stocks2.csv")

         Date   Close    Volume Symbol
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO

In [38]:
pd.read_csv("datasets/stocks3.csv")

         Date   Close    Volume Symbol
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

In [39]:
from glob import glob

In [40]:
stock_file = sorted(glob("datasets/stocks*.csv"))
stock_file

['datasets\\stocks.csv',
 'datasets\\stocks1.csv',
 'datasets\\stocks2.csv',
 'datasets\\stocks3.csv']

In [41]:
pd.concat((pd.read_csv(file) for file in stock_file))

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

In [42]:
pd.concat((pd.read_csv(file) for file in stock_file), ignore_index=True)

          Date   Close    Volume Symbol
0   2016-10-03   31.50  14070500   CSCO
1   2016-10-03  112.52  21701800   AAPL
2   2016-10-03   57.42  19189500   MSFT
3   2016-10-04  113.00  29736800   AAPL
4   2016-10-04   57.24  20085900   MSFT
5   2016-10-04   31.35  18460400   CSCO
6   2016-10-05   57.64  16726400   MSFT
7   2016-10-05   31.59  11808600   CSCO
8   2016-10-05  113.05  21453100   AAPL
9   2016-10-03   31.50  14070500   CSCO
10  2016-10-03  112.52  21701800   AAPL
11  2016-10-03   57.42  19189500   MSFT
12  2016-10-04  113.00  29736800   AAPL
13  2016-10-04   57.24  20085900   MSFT
14  2016-10-04   31.35  18460400   CSCO
15  2016-10-05   57.64  16726400   MSFT
16  2016-10-05   31.59  11808600   CSCO
17  2016-10-05  113.05  21453100   AAPL